Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 54, 54, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       73856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 26, 26, 128)       0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 26, 26, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 86528)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                5537856   
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 5,668,097
Trainable params: 5,668,097
Non-trainable params: 0
_________________________________________________________________
Found 865 images belonging to 2 classes.
Found 289 images belonging to 2 classes.
Epoch 1/10
8/8 [==============================] - 76s 9s/step - loss: 1.5477 - accuracy: 0.4805 - val_loss: 0.7059 - val_accuracy: 0.4531
Epoch 2/10
8/8 [==============================] - 46s 6s/step - loss: 0.6786 - accuracy: 0.5778 - val_loss: 0.6863 - val_accuracy: 0.4844
Epoch 3/10
7/8 [=========================>....] - ETA: 7s - loss: 0.6694 - accuracy: 0.6161 [reconnecting terminal]


[Reconnection succeeded]
8/8 [==============================] - 58s 7s/step - loss: 0.6771 - accuracy: 0.5977 - val_loss: 0.6828 - val_accuracy: 0.6250
Epoch 4/10
8/8 [==============================] - 52s 7s/step - loss: 0.6814 - accuracy: 0.5625 - val_loss: 0.6928 - val_accuracy: 0.4531
Epoch 5/10
8/8 [==============================] - 57s 7s/step - loss: 0.6951 - accuracy: 0.5234 - val_loss: 0.6132 - val_accuracy: 0.6364
Epoch 6/10
8/8 [==============================] - 81s 10s/step - loss: 0.6817 - accuracy: 0.6016 - val_loss: 0.6897 - val_accuracy: 0.5625
Epoch 7/10
8/8 [==============================] - 47s 6s/step - loss: 0.6633 - accuracy: 0.6489 - val_loss: 0.7733 - val_accuracy: 0.4688
Epoch 8/10
8/8 [==============================] - 51s 6s/step - loss: 0.6999 - accuracy: 0.5430 - val_loss: 0.6905 - val_accuracy: 0.5312
Epoch 9/10
8/8 [==============================] - 55s 7s/step - loss: 0.6832 - accuracy: 0.6289 - val_loss: 0.6931 - val_accuracy: 0.5312
Epoch 10/10
8/8 [==============================] - 54s 7s/step - loss: 0.6855 - accuracy: 0.5664 - val_loss: 0.6544 - val_accuracy: 0.4848
