Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 54, 54, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       73856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 26, 26, 128)       0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 26, 26, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 86528)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                5537856   
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 5,668,097
Trainable params: 5,668,097
Non-trainable params: 0
_________________________________________________________________
Found 258 images belonging to 2 classes.
Found 86 images belonging to 2 classes.
Epoch 1/10
8/8 [==============================] - 39s 5s/step - loss: 1.0570 - accuracy: 0.5177 - val_loss: 0.6898 - val_accuracy: 0.6094
Epoch 2/10
8/8 [==============================] - 33s 4s/step - loss: 0.7181 - accuracy: 0.5752 - val_loss: 0.6534 - val_accuracy: 0.6667
Epoch 3/10
8/8 [==============================] - 26s 3s/step - loss: 0.6878 - accuracy: 0.5133 - val_loss: 0.6932 - val_accuracy: 0.5000
Epoch 4/10
8/8 [==============================] - 31s 4s/step - loss: 0.6896 - accuracy: 0.6062 - val_loss: 0.6897 - val_accuracy: 0.6094
Epoch 5/10
8/8 [==============================] - 32s 4s/step - loss: 0.6901 - accuracy: 0.5547 - val_loss: 0.6920 - val_accuracy: 0.5370
Epoch 6/10
8/8 [==============================] - 24s 3s/step - loss: 0.6791 - accuracy: 0.5708 - val_loss: 0.6779 - val_accuracy: 0.6296
Epoch 7/10
8/8 [==============================] - 26s 3s/step - loss: 0.6950 - accuracy: 0.5561 - val_loss: 0.6836 - val_accuracy: 0.5625
Epoch 8/10
8/8 [==============================] - 33s 4s/step - loss: 0.6956 - accuracy: 0.5391 - val_loss: 0.6917 - val_accuracy: 0.5926
Epoch 9/10
8/8 [==============================] - 23s 3s/step - loss: 0.6854 - accuracy: 0.5885 - val_loss: 0.6852 - val_accuracy: 0.6296
Epoch 10/10
8/8 [==============================] - 32s 4s/step - loss: 0.6862 - accuracy: 0.5625 - val_loss: 0.6770 - val_accuracy: 0.6406
