Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 54, 54, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 52, 52, 128)       73856     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 26, 26, 128)       0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 26, 26, 128)       0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 86528)             0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                5537856   
_________________________________________________________________
dropout_8 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 65        
=================================================================
Total params: 5,668,097
Trainable params: 5,668,097
Non-trainable params: 0
_________________________________________________________________
Found 146 images belonging to 2 classes.
Found 49 images belonging to 2 classes.
Found 146 images belonging to 2 classes.
Found 49 images belonging to 2 classes.
Epoch 1/20
1/8 [==>...........................] - ETA: 50s - loss: 0.7093 - accuracy: 0.33332/8 [======>.......................] - ETA: 34s - loss: 2.3477 - accuracy: 0.45833/8 [==========>...................] - ETA: 26s - loss: 2.0323 - accuracy: 0.41674/8 [==============>...............] - ETA: 20s - loss: 1.8492 - accuracy: 0.43755/8 [=================>............] - ETA: 15s - loss: 1.6502 - accuracy: 0.40006/8 [=====================>........] - ETA: 10s - loss: 1.4928 - accuracy: 0.43067/8 [=========================>....] - ETA: 4s - loss: 1.3750 - accuracy: 0.4524 8/8 [==============================] - 39s 5s/step - loss: 1.2825 - accuracy: 0.4792 - val_loss: 0.6360 - val_accuracy: 0.7083
Epoch 2/20
1/8 [==>...........................] - ETA: 33s - loss: 0.6384 - accuracy: 0.75002/8 [======>.......................] - ETA: 15s - loss: 0.5012 - accuracy: 0.78573/8 [==========>...................] - ETA: 14s - loss: 0.6582 - accuracy: 0.65384/8 [==============>...............] - ETA: 12s - loss: 0.6909 - accuracy: 0.65795/8 [=================>............] - ETA: 9s - loss: 0.7596 - accuracy: 0.6000 6/8 [=====================>........] - ETA: 6s - loss: 0.7472 - accuracy: 0.59687/8 [=========================>....] - ETA: 2s - loss: 0.7441 - accuracy: 0.59388/8 [==============================] - 25s 3s/step - loss: 0.7427 - accuracy: 0.5921 - val_loss: 0.6921 - val_accuracy: 0.6250
Epoch 3/20
1/8 [==>...........................] - ETA: 26s - loss: 0.6880 - accuracy: 0.58332/8 [======>.......................] - ETA: 24s - loss: 0.6808 - accuracy: 0.66673/8 [==========>...................] - ETA: 21s - loss: 0.6774 - accuracy: 0.72224/8 [==============>...............] - ETA: 16s - loss: 0.6811 - accuracy: 0.66675/8 [=================>............] - ETA: 12s - loss: 0.6801 - accuracy: 0.68336/8 [=====================>........] - ETA: 8s - loss: 0.6812 - accuracy: 0.6667 7/8 [=========================>....] - ETA: 4s - loss: 0.6812 - accuracy: 0.66678/8 [==============================] - 39s 5s/step - loss: 0.6805 - accuracy: 0.6771 - val_loss: 0.6837 - val_accuracy: 0.8462
Epoch 4/20
1/8 [==>...........................] - ETA: 7s - loss: 0.6859 - accuracy: 0.58332/8 [======>.......................] - ETA: 17s - loss: 0.6866 - accuracy: 0.62503/8 [==========>...................] - ETA: 18s - loss: 0.6888 - accuracy: 0.58334/8 [==============>...............] - ETA: 16s - loss: 0.6858 - accuracy: 0.62505/8 [=================>............] - ETA: 13s - loss: 0.6849 - accuracy: 0.63336/8 [=====================>........] - ETA: 8s - loss: 0.6847 - accuracy: 0.6250 7/8 [=========================>....] - ETA: 4s - loss: 0.6880 - accuracy: 0.60718/8 [==============================] - 37s 5s/step - loss: 0.6851 - accuracy: 0.6250 - val_loss: 0.6881 - val_accuracy: 0.6250
Epoch 5/20
1/8 [==>...........................] - ETA: 30s - loss: 0.6718 - accuracy: 0.66672/8 [======>.......................] - ETA: 13s - loss: 0.6438 - accuracy: 0.71433/8 [==========>...................] - ETA: 15s - loss: 0.6380 - accuracy: 0.80774/8 [==============>...............] - ETA: 12s - loss: 0.6542 - accuracy: 0.71055/8 [=================>............] - ETA: 10s - loss: 0.6584 - accuracy: 0.68006/8 [=====================>........] - ETA: 7s - loss: 0.6576 - accuracy: 0.6774 7/8 [=========================>....] - ETA: 3s - loss: 0.6584 - accuracy: 0.67578/8 [==============================] - 30s 4s/step - loss: 0.6515 - accuracy: 0.6860 - val_loss: 0.5275 - val_accuracy: 0.6154
Epoch 6/20
1/8 [==>...........................] - ETA: 35s - loss: 0.6041 - accuracy: 0.75002/8 [======>.......................] - ETA: 29s - loss: 0.7508 - accuracy: 0.54173/8 [==========>...................] - ETA: 25s - loss: 0.7146 - accuracy: 0.58334/8 [==============>...............] - ETA: 20s - loss: 0.7140 - accuracy: 0.58335/8 [=================>............] - ETA: 15s - loss: 0.6940 - accuracy: 0.60006/8 [=====================>........] - ETA: 9s - loss: 0.6932 - accuracy: 0.6111 7/8 [=========================>....] - ETA: 4s - loss: 0.6995 - accuracy: 0.60718/8 [==============================] - 38s 5s/step - loss: 0.6850 - accuracy: 0.6250 - val_loss: 0.6324 - val_accuracy: 0.7083
Epoch 7/20
1/8 [==>...........................] - ETA: 31s - loss: 0.6306 - accuracy: 0.75002/8 [======>.......................] - ETA: 26s - loss: 0.6832 - accuracy: 0.66673/8 [==========>...................] - ETA: 24s - loss: 0.6619 - accuracy: 0.66674/8 [==============>...............] - ETA: 15s - loss: 0.6480 - accuracy: 0.68425/8 [=================>............] - ETA: 12s - loss: 0.6496 - accuracy: 0.68006/8 [=====================>........] - ETA: 8s - loss: 0.6487 - accuracy: 0.6613 7/8 [=========================>....] - ETA: 3s - loss: 0.6527 - accuracy: 0.65628/8 [==============================] - 33s 4s/step - loss: 0.6489 - accuracy: 0.6711 - val_loss: 0.6772 - val_accuracy: 0.6250
Epoch 8/20
1/8 [==>...........................] - ETA: 28s - loss: 0.6135 - accuracy: 0.75002/8 [======>.......................] - ETA: 26s - loss: 0.5701 - accuracy: 0.79173/8 [==========>...................] - ETA: 23s - loss: 0.6403 - accuracy: 0.66674/8 [==============>...............] - ETA: 20s - loss: 0.6401 - accuracy: 0.66675/8 [=================>............] - ETA: 15s - loss: 0.6416 - accuracy: 0.66676/8 [=====================>........] - ETA: 10s - loss: 0.6547 - accuracy: 0.63897/8 [=========================>....] - ETA: 5s - loss: 0.6428 - accuracy: 0.6548 8/8 [==============================] - 44s 5s/step - loss: 0.6620 - accuracy: 0.6354 - val_loss: 0.7480 - val_accuracy: 0.4615
Epoch 9/20
1/8 [==>...........................] - ETA: 18s - loss: 0.5607 - accuracy: 0.75002/8 [======>.......................] - ETA: 21s - loss: 0.5969 - accuracy: 0.70833/8 [==========>...................] - ETA: 21s - loss: 0.6584 - accuracy: 0.61114/8 [==============>...............] - ETA: 17s - loss: 0.6869 - accuracy: 0.56255/8 [=================>............] - ETA: 13s - loss: 0.6599 - accuracy: 0.61676/8 [=====================>........] - ETA: 9s - loss: 0.6637 - accuracy: 0.6250 7/8 [=========================>....] - ETA: 4s - loss: 0.6550 - accuracy: 0.65488/8 [==============================] - 37s 5s/step - loss: 0.6715 - accuracy: 0.6250 - val_loss: 0.6285 - val_accuracy: 0.7917
Epoch 10/20
1/8 [==>...........................] - ETA: 25s - loss: 0.7296 - accuracy: 0.50002/8 [======>.......................] - ETA: 25s - loss: 0.6519 - accuracy: 0.66673/8 [==========>...................] - ETA: 19s - loss: 0.6589 - accuracy: 0.66674/8 [==============>...............] - ETA: 12s - loss: 0.6356 - accuracy: 0.68425/8 [=================>............] - ETA: 10s - loss: 0.6425 - accuracy: 0.68006/8 [=====================>........] - ETA: 7s - loss: 0.6327 - accuracy: 0.7097 7/8 [=========================>....] - ETA: 3s - loss: 0.6329 - accuracy: 0.71628/8 [==============================] - 30s 4s/step - loss: 0.6382 - accuracy: 0.7093 - val_loss: 0.5495 - val_accuracy: 0.6923
Epoch 11/20
1/8 [==>...........................] - ETA: 32s - loss: 0.6447 - accuracy: 0.58332/8 [======>.......................] - ETA: 31s - loss: 0.6579 - accuracy: 0.62503/8 [==========>...................] - ETA: 24s - loss: 0.6674 - accuracy: 0.61114/8 [==============>...............] - ETA: 18s - loss: 0.7028 - accuracy: 0.54175/8 [=================>............] - ETA: 14s - loss: 0.6758 - accuracy: 0.60006/8 [=====================>........] - ETA: 9s - loss: 0.6646 - accuracy: 0.6250 7/8 [=========================>....] - ETA: 4s - loss: 0.6479 - accuracy: 0.65488/8 [==============================] - 33s 4s/step - loss: 0.6463 - accuracy: 0.6512 - val_loss: 0.6433 - val_accuracy: 0.6250
Epoch 12/20
1/8 [==>...........................] - ETA: 30s - loss: 0.6250 - accuracy: 0.75002/8 [======>.......................] - ETA: 26s - loss: 0.6503 - accuracy: 0.62503/8 [==========>...................] - ETA: 22s - loss: 0.6466 - accuracy: 0.61114/8 [==============>...............] - ETA: 17s - loss: 0.6676 - accuracy: 0.60425/8 [=================>............] - ETA: 10s - loss: 0.6243 - accuracy: 0.62006/8 [=====================>........] - ETA: 7s - loss: 0.6439 - accuracy: 0.5968 7/8 [=========================>....] - ETA: 3s - loss: 0.6358 - accuracy: 0.62168/8 [==============================] - 31s 4s/step - loss: 0.6372 - accuracy: 0.6395 - val_loss: 0.6362 - val_accuracy: 0.7083
Epoch 13/20
1/8 [==>...........................] - ETA: 31s - loss: 0.6867 - accuracy: 0.66672/8 [======>.......................] - ETA: 26s - loss: 0.6467 - accuracy: 0.75003/8 [==========>...................] - ETA: 20s - loss: 0.7009 - accuracy: 0.61114/8 [==============>...............] - ETA: 16s - loss: 0.6586 - accuracy: 0.66675/8 [=================>............] - ETA: 12s - loss: 0.6731 - accuracy: 0.65006/8 [=====================>........] - ETA: 8s - loss: 0.6850 - accuracy: 0.6250 7/8 [=========================>....] - ETA: 4s - loss: 0.6760 - accuracy: 0.63108/8 [==============================] - 41s 5s/step - loss: 0.6651 - accuracy: 0.6458 - val_loss: 0.6501 - val_accuracy: 0.6923
Epoch 14/20
1/8 [==>...........................] - ETA: 7s - loss: 0.6231 - accuracy: 0.66672/8 [======>.......................] - ETA: 18s - loss: 0.6204 - accuracy: 0.70833/8 [==========>...................] - ETA: 19s - loss: 0.6320 - accuracy: 0.69444/8 [==============>...............] - ETA: 16s - loss: 0.6334 - accuracy: 0.70835/8 [=================>............] - ETA: 9s - loss: 0.6555 - accuracy: 0.7000 6/8 [=====================>........] - ETA: 7s - loss: 0.6464 - accuracy: 0.70977/8 [=========================>....] - ETA: 3s - loss: 0.6623 - accuracy: 0.66228/8 [==============================] - 31s 4s/step - loss: 0.6618 - accuracy: 0.6628 - val_loss: 0.6490 - val_accuracy: 0.7083
Epoch 15/20
1/8 [==>...........................] - ETA: 18s - loss: 0.7122 - accuracy: 0.58332/8 [======>.......................] - ETA: 21s - loss: 0.6946 - accuracy: 0.62503/8 [==========>...................] - ETA: 20s - loss: 0.6809 - accuracy: 0.63894/8 [==============>...............] - ETA: 16s - loss: 0.6785 - accuracy: 0.62505/8 [=================>............] - ETA: 13s - loss: 0.6771 - accuracy: 0.63336/8 [=====================>........] - ETA: 8s - loss: 0.6819 - accuracy: 0.6250 7/8 [=========================>....] - ETA: 4s - loss: 0.6739 - accuracy: 0.64298/8 [==============================] - 35s 4s/step - loss: 0.6691 - accuracy: 0.6458 - val_loss: 0.5797 - val_accuracy: 0.6154
Epoch 16/20
1/8 [==>...........................] - ETA: 29s - loss: 0.6307 - accuracy: 0.66672/8 [======>.......................] - ETA: 26s - loss: 0.5998 - accuracy: 0.79173/8 [==========>...................] - ETA: 20s - loss: 0.6229 - accuracy: 0.72224/8 [==============>...............] - ETA: 16s - loss: 0.6352 - accuracy: 0.70835/8 [=================>............] - ETA: 12s - loss: 0.6462 - accuracy: 0.68336/8 [=====================>........] - ETA: 8s - loss: 0.6533 - accuracy: 0.6667 7/8 [=========================>....] - ETA: 4s - loss: 0.6678 - accuracy: 0.63108/8 [==============================] - 30s 4s/step - loss: 0.6717 - accuracy: 0.6279 - val_loss: 0.6446 - val_accuracy: 0.7500
Epoch 17/20
1/8 [==>...........................] - ETA: 32s - loss: 0.6105 - accuracy: 0.75002/8 [======>.......................] - ETA: 25s - loss: 0.6237 - accuracy: 0.70833/8 [==========>...................] - ETA: 21s - loss: 0.6456 - accuracy: 0.66674/8 [==============>...............] - ETA: 16s - loss: 0.6791 - accuracy: 0.58335/8 [=================>............] - ETA: 12s - loss: 0.6752 - accuracy: 0.60006/8 [=====================>........] - ETA: 8s - loss: 0.6531 - accuracy: 0.6528 7/8 [=========================>....] - ETA: 4s - loss: 0.6536 - accuracy: 0.65488/8 [==============================] - 31s 4s/step - loss: 0.6404 - accuracy: 0.6628 - val_loss: 0.6512 - val_accuracy: 0.5833
Epoch 18/20
1/8 [==>...........................] - ETA: 26s - loss: 0.7384 - accuracy: 0.41672/8 [======>.......................] - ETA: 25s - loss: 0.6557 - accuracy: 0.58333/8 [==========>...................] - ETA: 20s - loss: 0.6838 - accuracy: 0.58334/8 [==============>...............] - ETA: 15s - loss: 0.6602 - accuracy: 0.62505/8 [=================>............] - ETA: 12s - loss: 0.6603 - accuracy: 0.63336/8 [=====================>........] - ETA: 8s - loss: 0.6595 - accuracy: 0.6250 7/8 [=========================>....] - ETA: 4s - loss: 0.6425 - accuracy: 0.65488/8 [==============================] - 41s 5s/step - loss: 0.6495 - accuracy: 0.6458 - val_loss: 0.5571 - val_accuracy: 0.8462
Epoch 19/20
1/8 [==>...........................] - ETA: 7s - loss: 0.5778 - accuracy: 0.83332/8 [======>.......................] - ETA: 14s - loss: 0.6380 - accuracy: 0.70833/8 [==========>...................] - ETA: 18s - loss: 0.6606 - accuracy: 0.69444/8 [==============>...............] - ETA: 15s - loss: 0.6246 - accuracy: 0.72925/8 [=================>............] - ETA: 12s - loss: 0.6541 - accuracy: 0.68336/8 [=====================>........] - ETA: 7s - loss: 0.6565 - accuracy: 0.6667 7/8 [=========================>....] - ETA: 3s - loss: 0.6651 - accuracy: 0.65488/8 [==============================] - 32s 4s/step - loss: 0.6605 - accuracy: 0.6458 - val_loss: 0.7021 - val_accuracy: 0.5833
Epoch 20/20
1/8 [==>...........................] - ETA: 27s - loss: 0.5522 - accuracy: 0.75002/8 [======>.......................] - ETA: 12s - loss: 0.4792 - accuracy: 0.78573/8 [==========>...................] - ETA: 14s - loss: 0.5867 - accuracy: 0.69234/8 [==============>...............] - ETA: 13s - loss: 0.5936 - accuracy: 0.68425/8 [=================>............] - ETA: 11s - loss: 0.6399 - accuracy: 0.64006/8 [=====================>........] - ETA: 8s - loss: 0.6367 - accuracy: 0.6290 7/8 [=========================>....] - ETA: 4s - loss: 0.6297 - accuracy: 0.63518/8 [==============================] - 33s 4s/step - loss: 0.6415 - accuracy: 0.6163 - val_loss: 0.4405 - val_accuracy: 0.6154
